app/controllers/users_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" IS NULL LIMIT 1
SELECT "microposts".* FROM "microposts" WHERE ("microposts".user_id = 1) ORDER BY microposts.created_at DESC LIMIT 30 OFFSET 0
SELECT "users".* FROM "users" LIMIT 6
SELECT COUNT(*) FROM "microposts" WHERE ("microposts".user_id = 1)
---
 def show
  @user = User.find(params[:id])
  @microposts = @user.microposts.paginate(:page => params[:page])

INSERT INTO "users" ("name", "email", "created_at", "updated_at", "encrypted_password", "salt", "admin") VALUES ('Example User', 'user@example.com', '2011-09-09 11:04:34.902778', '2011-09-09 11:04:34.902778', '5402815b5ceea6db79d9fb1d1fcb6712211c23f850b2bbfa10b5581f5d2e4337', 'ca3bb1cdd7ba2cee5641a87c39bd83bc9b371e6a81f61eff3fbab580a715b355', 'f')
---
 def create
  @user = User.new(params[:user])
  if @user.save

UPDATE "users" SET "name" = 'New Name', "email" = 'user@example.org', "encrypted_password" = 'e4cafd575dfaecdd05a5c0223e18126c3236258d6e4280b2583bb7815b198b02', "updated_at" = '2011-09-06 16:38:55.494423' WHERE "users"."id" = 1
---
 def update
  if @user.update_attributes(params[:user])

DELETE FROM "users" WHERE "users"."id" = 14
SELECT "users".* FROM "users" WHERE "users"."id" IS NULL LIMIT 1
---
 def destroy
  User.find(params[:id]).destroy